       01  ORDER.
           03  OrderId                      PIC X(10).
           03  PetId                        PIC X(10).
           03  Quantity                     PIC X(13).
           03  ShipDate                     PIC X(20).
           03  Status                       PIC X(10).
           03  Complete                     PIC X(1).
